<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Couchbase Server 1.8 &#12510;&#12491;&#12517;&#12450;&#12523; - &#31532;5&#31456; &#31649;&#29702;&#12479;&#12473;&#12463; - 5.1.2. &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#32771;&#24942;&#20107;&#38917;</title><link href="couchdocs.css" type="text/css" rel="stylesheet"><meta content="DocBook XSL Stylesheets V1.76.1" name="generator"><link rel="home" href="index.html" title="Couchbase Server 1.8 &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="up" href="couchbase-admin-tasks-failover.html" title="5.1. Couchbase&#12391;&#12398;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;"><link rel="prev" href="couchbase-admin-tasks-failover-automatic.html" title="5.1.1. &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;"><link rel="next" href="couchbase-admin-tasks-failover-monitored.html" title="5.1.3. &#12501;&#12455;&#12540;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#30435;&#35222;"><meta name="date" content="2013-05-23T20:49:26+00:00"><link type="image/x-icon" href="http://www.couchbase.com/sites/default/files/nosql_favicon.ico" rel="shortcut icon"><div class="inpagenav"><div class="googlesearch"><div class="inpagenav-home-title">Search:</div><form method="GET" action="http://www.google.com/search"><input type="text" name="q" size="24" maxlength="255"><input type="hidden" name="domains" value="www.couchbase.com/docs"><br><input type="radio" name="sitesearch" value="www.couchbase.com/docs"><b>Search all manuals</b><br><input type="radio" name="sitesearch" value="www.couchbase.com/docs/couchbase-manual-1.8/" checked><b>Search this manual</b><input type="submit" name="btnG" value="Google Search"></form></div><div class="inpagenav-home"><div class="inpagenav-home-title">Manual</div><a href="index.html"> Couchbase Server 1.8 &#12510;&#12491;&#12517;&#12450;&#12523;</a></div><div class="inpagenav-genericcommunity"><div class="inpagenav-genericcommunity-title">Additional Resources</div><div><a href="http://www.couchbase.com/wiki">
              Community Wiki
            </a></div><div><a href="http://www.couchbase.com/forums">
              Community Forums
            </a></div><div><a href="http://www.couchbase.com/develop">
              Couchbase SDKs
            </a></div></div><div class="inpagenav-up"><div class="inpagenav-up-title">Parent Section</div><a href="couchbase-admin-tasks-failover.html">5.1 Couchbase&#12391;&#12398;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;</a></div><div class="inpagenav-siblings"><div class="inpagenav-siblings-title">Chapter Sections</div><div class="inpagenav-sibling-link"><a href="couchbase-admin-tasks-failover-automatic.html">5.1.1 &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;</a></div><div class="inpagenav-sibling-link"><a class="currentnav" href="couchbase-admin-tasks-failover-automatic-considerations.html">5.1.2 &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#32771;&#24942;&#20107;&#38917;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-admin-tasks-failover-monitored.html">5.1.3 &#12501;&#12455;&#12540;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#30435;&#35222;</a></div></div><div class="inpagenav-chapters"><div class="inpagenav-chapters-title">Chapters</div><div class="inpagenav-chapters-link"><a href="couchbase-server-preface.html"> &#12399;&#12376;&#12417;&#12395;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-introduction.html">1 Couchbase Server&#12398;&#32057;&#20171;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-getting-started.html">2 Couchbase Server&#20837;&#38272;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-basics.html">3 &#12463;&#12521;&#12473;&#12479;&#31649;&#29702;&#12398;&#22522;&#26412;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-bestpractice.html">4 &#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-tasks.html">5 &#31649;&#29702;&#12479;&#12473;&#12463;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-web-console.html">6 Couchbase&#31649;&#29702;Web&#12467;&#12531;&#12477;&#12540;&#12523;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-cmdline.html">7 Couchbase&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-restapi.html">8 Couchbase &#31649;&#29702; REST API</a></div><div class="inpagenav-chapters-link"><a href="couchbase-developing.html">9 Couchbase&#12434;&#20351;&#29992;&#12375;&#12383;&#38283;&#30330;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-client-development.html">10 Couchbase&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#38283;&#30330;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-architecture.html">11 Couchbase&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-monitoring.html">12 Couchbase&#12398;&#30435;&#35222;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-troubleshooting.html">13 &#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-faq.html">A FAQ</a></div><div class="inpagenav-chapters-link"><a href="couchbase-uninstalling.html">B Couchbase Server&#12398;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></div><div class="inpagenav-chapters-link"><a href="licenses.html">C Licenses</a></div></div></div><script type="text/javascript">
var _gaq = _gaq || [];
_gaq.push(['_setAccount', 'UA-7763794-1']);
_gaq.push(['_setDomainName', '.couchbase.com']);
_gaq.push(['_setAllowLinker', true]);
_gaq.push(['_setAllowHash', false]);
_gaq.push(['_trackPageview']);
(function() {
var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
})();
</script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table summary="Navigation header" width="100%"><tr><th align="center" colspan="3">5.1.2. &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#32771;&#24942;&#20107;&#38917;</th></tr><tr><td align="left" width="20%"><a accesskey="p" href="couchbase-admin-tasks-failover-automatic.html">&#25147;&#12427;</a>&nbsp;</td><th align="center" width="60%">5.1. Couchbase&#12391;&#12398;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;</th><td align="right" width="20%">&nbsp;<a accesskey="n" href="couchbase-admin-tasks-failover-monitored.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="section" title="5.1.2. &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#32771;&#24942;&#20107;&#38917;"><div class="titlepage"><div><div><h3 class="title"><a name="couchbase-admin-tasks-failover-automatic-considerations"></a>5.1.2. &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#32771;&#24942;&#20107;&#38917;</h3></div></div></div><p>
        &#20998;&#25955;&#12471;&#12473;&#12486;&#12512;&#20869;&#12391;&#33258;&#21205;&#30340;&#12395;&#38556;&#23475;&#12392;&#12394;&#12387;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#21361;&#38522;&#12394;&#23384;&#22312;&#12391;&#12377;&#12290;&#21313;&#20998;&#12395;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#25126;&#30053;&#12395;&#12424;&#12426;&#12289;&#33258;&#30330;&#30340;&#12395;&#12458;&#12501;&#12521;&#12452;&#12531;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#28961;&#25968;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#20197;&#19979;&#12398;&#29366;&#27841;&#12399;&#30064;&#24120;&#12394;&#21205;&#20316;&#12434;&#24341;&#12365;&#36215;&#12371;&#12377;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306;
      </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
            <span class="bold"><strong>&#12471;&#12490;&#12522;&#12458;1 -
            &#39165;&#21644;&#29366;&#24907;</strong></span>
          </p><p>
            5&#12494;&#12540;&#12489;&#12398;Couchbase&#12463;&#12521;&#12473;&#12479;&#12364;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#36000;&#33655;&#12395;&#38306;&#12375;&#12390;80&#12316;90&#12497;&#12540;&#12475;&#12531;&#12488;&#12398;&#21512;&#35336;&#23481;&#37327;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12471;&#12490;&#12522;&#12458;&#12434;&#24819;&#20687;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#38480;&#30028;&#12391;&#12399;&#12354;&#12427;&#12364;&#12289;&#12377;&#12409;&#12390;&#12358;&#12414;&#12367;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#20170;&#12289;&#12494;&#12540;&#12489;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#33258;&#21205;&#30340;&#12395;&#12381;&#12398;&#12494;&#12540;&#12489;&#12434;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12377;&#12427;&#12371;&#12392;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;&#27531;&#12426;&#12398;4&#12388;&#12398;&#12494;&#12540;&#12489;&#12398;&#12377;&#12409;&#12390;&#12364;&#12289;&#26032;&#12383;&#12395;&#22679;&#12360;&#12383;&#36000;&#33655;&#12434;&#25104;&#21151;&#35023;&#12395;&#20966;&#29702;&#12391;&#12365;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#12354;&#12426;&#12360;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12435;&#12394;&#12371;&#12392;&#12434;&#12377;&#12428;&#12400;&#12289;&#26032;&#12383;&#12394;&#12494;&#12540;&#12489;&#12364;&#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#38556;&#23475;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#20840;&#20307;&#12398;&#26368;&#32066;&#30340;&#12394;&#25613;&#22833;&#12395;&#12388;&#12394;&#12364;&#12426;&#24471;&#12414;&#12377;&#12290;1/5&#12398;&#35201;&#27714;&#12364;&#20966;&#29702;&#12373;&#12428;&#12394;&#12356;&#26041;&#12364;&#12289;&#12414;&#12387;&#12383;&#12367;&#35201;&#27714;&#12364;&#20966;&#29702;&#12373;&#12428;&#12394;&#12356;&#12424;&#12426;&#12289;&#12424;&#12426;&#26395;&#12414;&#12375;&#12356;&#12371;&#12392;&#12399;&#12399;&#12387;&#12365;&#12426;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
          </p><p>
            &#22823;&#35215;&#27169;&#12394;&#12477;&#12540;&#12471;&#12515;&#12523;&#12493;&#12483;&#12488;&#12527;&#12540;&#12461;&#12531;&#12464;&#12469;&#12452;&#12488;&#12398;&#12487;&#12540;&#12479;&#12452;&#12531;&#12501;&#12521;&#12473;&#12488;&#12521;&#12463;&#12481;&#12515;&#12450;&#12540;&#12461;&#12486;&#12463;&#12488;&#12364;&#12289;&#35328;&#12387;&#12390;&#12356;&#12414;&#12375;&#12383;&#65306;"&#12418;&#12375;&#21322;&#20998;&#12398;&#12469;&#12540;&#12496;&#12540;&#12364;&#12480;&#12454;&#12531;&#12375;&#12390;&#12418;&#12289;&#12414;&#12384;&#21322;&#20998;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#12398;&#12394;&#12425;&#12289;&#12365;&#12431;&#12417;&#12390;&#12424;&#12367;&#12420;&#12387;&#12390;&#12356;&#12427;&#12392;&#35328;&#12360;&#12427;&#12398;&#12391;&#12394;&#12356;&#12363;&#12394;"&#65288;&#12497;&#12521;&#12501;&#12524;&#12540;&#12474;&#65289;
          </p><p>
            &#12371;&#12428;&#12395;&#23550;&#12377;&#12427;&#35299;&#27770;&#31574;&#12399;&#12289;&#21336;&#19968;&#12494;&#12540;&#12489;&#38556;&#23475;&#12434;&#12356;&#12387;&#12383;&#12435;&#35377;&#23481;&#12375;&#12289;&#26032;&#12375;&#12356;&#12469;&#12540;&#12496;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#21516;&#26178;&#12395;&#12289;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#29366;&#24907;&#12395;&#12510;&#12540;&#12463;&#12375;&#12390;&#12363;&#12425;&#12522;&#12496;&#12521;&#12531;&#12473;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12371;&#12398;&#26041;&#27861;&#12391;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12540;&#20840;&#20307;&#12364;&#12480;&#12454;&#12531;&#12377;&#12427;&#12424;&#12426;&#12416;&#12375;&#12429;&#12289;&#31777;&#21336;&#12394;&#37096;&#20998;&#30340;&#20572;&#27490;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12494;&#8203;&#8203;&#12540;&#12489;&#12398;&#38556;&#23475;&#12434;&#12524;&#12503;&#12522;&#12459;&#12364;&#24341;&#12365;&#32153;&#12356;&#12391;&#20966;&#29702;&#12377;&#12427;&#12398;&#12395;&#21313;&#20998;&#12394;&#23481;&#37327;&#12434;&#30906;&#23455;&#12395;&#29992;&#24847;&#12377;&#12427;&#12392;&#12356;&#12358;&#35299;&#27770;&#31574;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
          </p></li><li class="listitem"><p>
            <span class="bold"><strong>&#12471;&#12490;&#12522;&#12458;2 -
            &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#20998;&#26029;</strong></span>
          </p><p>
            &#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#20998;&#26029;&#12364;Couchbase&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#12391;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12289;&#33258;&#21205;&#12501;&#12455;&#12540;&#12523;&#12458;&#12540;&#12496;&#12540;&#12395;&#12424;&#12426;&#12289;&#21452;&#26041;&#12364;&#12362;&#20114;&#12356;&#12395;&#33258;&#21205;&#30340;&#12395;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;&#20998;&#26029;&#12373;&#12428;&#12383;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12381;&#12428;&#12382;&#12428;&#12364;&#12289;&#20840;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#31354;&#38291;&#12398;&#36012;&#20219;&#12434;&#36000;&#12362;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;&#12381;&#12375;&#12390;&#12381;&#12428;&#12425;&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#37096;&#12391;&#12399;1&#12388;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;ID&#12395;&#38306;&#12375;&#12390;&#25972;&#21512;&#24615;&#12364;&#21462;&#12428;&#12383;&#29366;&#24907;&#12392;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;2&#12388;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#38291;&#12391;&#12487;&#12540;&#12479;&#12398;&#19981;&#25972;&#21512;&#12364;&#30330;&#29983;&#12375;&#22987;&#12417;&#12414;&#12377;&#12290;&#25201;&#12358;&#12487;&#12540;&#12479;&#12420;&#12450;&#12463;&#12475;&#12473;&#12497;&#12479;&#12540;&#12531;&#12398;&#24615;&#36074;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#24046;&#30064;&#12434;&#20462;&#24489;&#12377;&#12427;&#12371;&#12392;&#12399;&#22256;&#38627;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
          </p><p>
            &#20108;&#12388;&#12398;&#37096;&#20998;&#30340;&#12394;&#12463;&#12521;&#12473;&#12479;&#12398;&#19968;&#12388;&#12364;&#12289;&#12377;&#12409;&#12390;&#12398;&#12488;&#12521;&#12501;&#12451;&#12483;&#12463;&#12395;&#23550;&#24540;&#12391;&#12365;&#12427;&#12411;&#12393;&#21313;&#20998;&#12395;&#22823;&#12365;&#12356;&#12392;&#20206;&#23450;&#12377;&#12427;&#12392;&#12289;&#27425;&#12398;&#35299;&#27770;&#31574;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12408;&#12398;&#12377;&#12409;&#12390;&#12398;&#12488;&#12521;&#12501;&#12451;&#12483;&#12463;&#12434;&#12381;&#12398;&#19968;&#12388;&#12398;&#37096;&#20998;&#30340;&#12394;&#12463;&#12521;&#12473;&#12479;&#12408;&#35480;&#23566;&#12375;&#12289;&#12381;&#12398;&#24460;&#12289;&#20197;&#21069;&#12395;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12384;&#12387;&#12383;&#12510;&#12471;&#12531;&#21152;&#12360;&#12289;&#20803;&#12398;&#12463;&#12521;&#12473;&#12479;&#12469;&#12452;&#12474;&#12395;&#24489;&#20803;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;
          </p></li><li class="listitem"><p>
            <span class="bold"><strong>&#12471;&#12490;&#12522;&#12458;3 -
            &#12494;&#12540;&#12489;&#12398;&#21205;&#20316;&#19981;&#33391;</strong></span>
          </p><p>
            &#19968;&#12388;&#12398;&#12494;&#12540;&#12489;&#12364;&#12463;&#12521;&#12473;&#12479;&#12408;&#12398;&#25509;&#32154;&#12434;&#22833;&#12356;&#65288;&#12414;&#12383;&#12399;&#12289;&#12381;&#12358;&#21028;&#23450;&#12375;&#65289;&#12289;&#12381;&#12398;&#12494;&#12540;&#12489;&#12364;&#33258;&#21205;&#30340;&#12395;&#12381;&#12398;&#20182;&#12398;&#12463;&#12521;&#12473;&#12479;&#12434;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12391;&#12365;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12494;&#12540;&#12489;&#12364;&#29420;&#31435;&#12375;&#12383;&#12463;&#12521;&#12473;&#12479;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12381;&#12398;&#32080;&#26524;&#12289;&#19978;&#35352;&#12392;&#21516;&#27096;&#12394;&#12497;&#12540;&#12486;&#12451;&#12471;&#12519;&#12531;&#12398;&#29366;&#27841;&#12364;&#20877;&#12403;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
          </p><p>
            &#12371;&#12398;&#22580;&#21512;&#12289;&#35299;&#27770;&#31574;&#12399;&#12289;&#25509;&#32154;&#12398;&#21839;&#38988;&#12434;&#25345;&#12388;&#12494;&#12540;&#12489;&#12434;&#12480;&#12454;&#12531;&#12373;&#12379;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#27531;&#12426;&#12398;&#37096;&#20998;&#12395;&#36000;&#33655;&#12434;&#20966;&#29702;&#12373;&#12379;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#65288;&#20351;&#29992;&#21487;&#33021;&#12394;&#20104;&#20633;&#12398;&#23481;&#37327;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#20206;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#65289;
          </p></li></ul></div></div><div class="navfooter"><hr><table summary="Navigation footer" width="100%"><tr><td align="left" width="40%"><a accesskey="p" href="couchbase-admin-tasks-failover-automatic.html">&#25147;&#12427;</a>&nbsp;</td><td align="center" width="20%"><a accesskey="u" href="couchbase-admin-tasks-failover.html">&#19978;&#12395;&#25147;&#12427;</a></td><td align="right" width="40%">&nbsp;<a accesskey="n" href="couchbase-admin-tasks-failover-monitored.html">&#27425;&#12408;</a></td></tr><tr><td valign="top" align="left" width="40%">5.1.1. &#33258;&#21205;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&nbsp;</td><td align="center" width="20%"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td valign="top" align="right" width="40%">&nbsp;5.1.3. &#12501;&#12455;&#12540;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#30435;&#35222;</td></tr></table></div><hr><div class="couchone-link">
      Copyright (c) 2010-2013<a href="http://www.couchbase.com">Couchbase, Inc.</a></div></body></html>