<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Couchbase Server 1.8 &#12510;&#12491;&#12517;&#12450;&#12523; - &#31532;1&#31456; Couchbase Server&#12398;&#32057;&#20171; - 1.3.3. &#12513;&#12514;&#12522;&#12463;&#12457;&#12540;&#12479;&#12398;&#35373;&#23450;</title><link href="couchdocs.css" type="text/css" rel="stylesheet"><meta content="DocBook XSL Stylesheets V1.76.1" name="generator"><link rel="home" href="index.html" title="Couchbase Server 1.8 &#12510;&#12491;&#12517;&#12450;&#12523;"><link rel="up" href="couchbase-introduction-architecture.html" title="1.3. &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12392;&#27010;&#24565;"><link rel="prev" href="couchbase-introduction-architecture-clustermanager.html" title="1.3.2. &#12463;&#12521;&#12473;&#12479;&#12510;&#12493;&#12540;&#12472;&#12515;"><link rel="next" href="couchbase-introduction-architecture-buckets.html" title="1.3.4. &#12496;&#12465;&#12483;&#12488;"><meta name="date" content="2013-05-23T20:49:26+00:00"><link type="image/x-icon" href="http://www.couchbase.com/sites/default/files/nosql_favicon.ico" rel="shortcut icon"><div class="inpagenav"><div class="googlesearch"><div class="inpagenav-home-title">Search:</div><form method="GET" action="http://www.google.com/search"><input type="text" name="q" size="24" maxlength="255"><input type="hidden" name="domains" value="www.couchbase.com/docs"><br><input type="radio" name="sitesearch" value="www.couchbase.com/docs"><b>Search all manuals</b><br><input type="radio" name="sitesearch" value="www.couchbase.com/docs/couchbase-manual-1.8/" checked><b>Search this manual</b><input type="submit" name="btnG" value="Google Search"></form></div><div class="inpagenav-home"><div class="inpagenav-home-title">Manual</div><a href="index.html"> Couchbase Server 1.8 &#12510;&#12491;&#12517;&#12450;&#12523;</a></div><div class="inpagenav-genericcommunity"><div class="inpagenav-genericcommunity-title">Additional Resources</div><div><a href="http://www.couchbase.com/wiki">
              Community Wiki
            </a></div><div><a href="http://www.couchbase.com/forums">
              Community Forums
            </a></div><div><a href="http://www.couchbase.com/develop">
              Couchbase SDKs
            </a></div></div><div class="inpagenav-up"><div class="inpagenav-up-title">Parent Section</div><a href="couchbase-introduction-architecture.html">1.3 &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12392;&#27010;&#24565;</a></div><div class="inpagenav-siblings"><div class="inpagenav-siblings-title">Chapter Sections</div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-nodes.html">1.3.1 &#12494;&#12540;&#12489;&#12392;&#12463;&#12521;&#12473;&#12479;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-clustermanager.html">1.3.2 &#12463;&#12521;&#12473;&#12479;&#12510;&#12493;&#12540;&#12472;&#12515;</a></div><div class="inpagenav-sibling-link"><a class="currentnav" href="couchbase-introduction-architecture-quotas.html">1.3.3 &#12513;&#12514;&#12522;&#12463;&#12457;&#12540;&#12479;&#12398;&#35373;&#23450;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-buckets.html">1.3.4 &#12496;&#12465;&#12483;&#12488;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-vbuckets.html">1.3.5 vBuckets</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-diskstorage.html">1.3.6 &#12487;&#12451;&#12473;&#12463;&#12473;&#12488;&#12524;&#12540;&#12472;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-failover.html">1.3.7 &#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-clientinterface.html">1.3.8 &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-administration.html">1.3.9 &#31649;&#29702;&#12484;&#12540;&#12523;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-introduction-architecture-stats.html">1.3.10 &#32113;&#35336;&#12392;&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;</a></div></div><div class="inpagenav-chapters"><div class="inpagenav-chapters-title">Chapters</div><div class="inpagenav-chapters-link"><a href="couchbase-server-preface.html"> &#12399;&#12376;&#12417;&#12395;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-introduction.html">1 Couchbase Server&#12398;&#32057;&#20171;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-getting-started.html">2 Couchbase Server&#20837;&#38272;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-basics.html">3 &#12463;&#12521;&#12473;&#12479;&#31649;&#29702;&#12398;&#22522;&#26412;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-bestpractice.html">4 &#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-tasks.html">5 &#31649;&#29702;&#12479;&#12473;&#12463;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-web-console.html">6 Couchbase&#31649;&#29702;Web&#12467;&#12531;&#12477;&#12540;&#12523;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-cmdline.html">7 Couchbase&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-restapi.html">8 Couchbase &#31649;&#29702; REST API</a></div><div class="inpagenav-chapters-link"><a href="couchbase-developing.html">9 Couchbase&#12434;&#20351;&#29992;&#12375;&#12383;&#38283;&#30330;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-client-development.html">10 Couchbase&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#38283;&#30330;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-architecture.html">11 Couchbase&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-monitoring.html">12 Couchbase&#12398;&#30435;&#35222;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-troubleshooting.html">13 &#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-faq.html">A FAQ</a></div><div class="inpagenav-chapters-link"><a href="couchbase-uninstalling.html">B Couchbase Server&#12398;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></div><div class="inpagenav-chapters-link"><a href="licenses.html">C Licenses</a></div></div></div><script type="text/javascript">
var _gaq = _gaq || [];
_gaq.push(['_setAccount', 'UA-7763794-1']);
_gaq.push(['_setDomainName', '.couchbase.com']);
_gaq.push(['_setAllowLinker', true]);
_gaq.push(['_setAllowHash', false]);
_gaq.push(['_trackPageview']);
(function() {
var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
})();
</script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table summary="Navigation header" width="100%"><tr><th align="center" colspan="3">1.3.3. &#12513;&#12514;&#12522;&#12463;&#12457;&#12540;&#12479;&#12398;&#35373;&#23450;</th></tr><tr><td align="left" width="20%"><a accesskey="p" href="couchbase-introduction-architecture-clustermanager.html">&#25147;&#12427;</a>&nbsp;</td><th align="center" width="60%">1.3. &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12392;&#27010;&#24565;</th><td align="right" width="20%">&nbsp;<a accesskey="n" href="couchbase-introduction-architecture-buckets.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="section" title="1.3.3. &#12513;&#12514;&#12522;&#12463;&#12457;&#12540;&#12479;&#12398;&#35373;&#23450;"><div class="titlepage"><div><div><h3 class="title"><a name="couchbase-introduction-architecture-quotas"></a>1.3.3. &#12513;&#12514;&#12522;&#12463;&#12457;&#12540;&#12479;&#12398;&#35373;&#23450;</h3></div></div></div><p>
        Couchbase
        Server&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#30064;&#12394;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#12414;&#12383;&#12364;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12513;&#12514;&#12522;&#12434;&#31649;&#29702;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
      </p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>
            <span class="bold"><strong>&#12463;&#12521;&#12473;&#12479;&#12398;&#12494;&#12540;&#12489;&#12398;&#31649;&#29702;&#12289;&#12487;&#12451;&#12473;&#12463;&#12392;&#12513;&#12514;&#12522;</strong></span>
          </p><p>
            Couchbase
            Server&#12399;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12494;&#12540;&#12489;&#12398;&#12487;&#12451;&#12473;&#12463;&#12392;&#12513;&#12514;&#12522;&#38291;&#12398;&#12527;&#12540;&#12461;&#12531;&#12464;&#12475;&#12483;&#12488;&#12434;&#33258;&#21205;&#30340;&#12395;&#31649;&#29702;&#12375;&#12289;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12375;&#12390;&#12356;&#12427;&#35079;&#25968;&#12398;&#12494;&#12540;&#12489;&#12391;&#21033;&#29992;&#21487;&#33021;&#12394;RAM&#12424;&#12426;&#22823;&#12365;&#12394;&#12527;&#12540;&#12461;&#12531;&#12464;&#12475;&#12483;&#12488;&#12434;&#25201;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#39640;&#12356;&#12473;&#12523;&#12540;&#12503;&#12483;&#12488;&#12392;&#20302;&#12356;&#12524;&#12452;&#12486;&#12531;&#12471;&#12434;&#20445;&#12388;&#12395;&#12399;&#12289;Couchbase
            Server&#12399;&#12289;&#24120;&#12395;&#12513;&#12514;&#12522;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#38917;&#30446;&#12395;&#38306;&#12377;&#12427;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20445;&#25345;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
          </p><p>
            Couchbase
            Server&#12398;&#35373;&#23450;&#12395;&#12399;&#12289;&#12513;&#12514;&#12522;&#12398;&#21106;&#12426;&#24403;&#12390;&#37327;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Couchbase
            Server&#12399;&#33258;&#21205;&#30340;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12513;&#12514;&#12522;&#12398;&#21106;&#12426;&#24403;&#12390;&#37327;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;&#12513;&#12514;&#12522;&#12363;&#12425;&#12487;&#12451;&#12473;&#12463;&#12408;&#38917;&#30446;&#12434;&#31227;&#34892;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#12425;&#12398;&#38917;&#30446;&#12364;&#24460;&#12391;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12513;&#12514;&#12522;&#12408;&#31227;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#25805;&#20316;&#12399;&#12289;&#21177;&#29575;&#12434;&#39640;&#12417;&#12427;&#12383;&#12417;&#12395;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#23450;&#26399;&#30340;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;
          </p><p>
            &#29694;&#26178;&#28857;&#12391;&#12399;&#12289;&#12487;&#12451;&#12473;&#12463;&#19978;&#12398;&#27704;&#32154;&#30340;&#12394;&#12473;&#12488;&#12524;&#12540;&#12472;&#12398;&#21106;&#12426;&#24403;&#12390;&#12434;&#23450;&#32681;&#12377;&#12427;&#27231;&#33021;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12399;&#36969;&#20999;&#12395;&#12487;&#12451;&#12473;&#12463;&#20351;&#29992;&#29575;&#12434;&#30435;&#35222;&#12375;&#12289;&#65288;Couchbase&#12363;&#12425;&#12487;&#12540;&#12479;&#12434;&#21066;&#38500;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#33258;&#20307;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12363;&#12289;&#35079;&#25968;&#12398;&#12494;&#12540;&#12489;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12391;&#23481;&#37327;&#12434;&#36861;&#21152;&#12377;&#12427;&#12363;&#12398;&#12393;&#12428;&#12363;&#65289;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#31649;&#29702;&#32773;&#27425;&#31532;&#12391;&#12377;&#12290;
          </p><p>
            Couchbase
            Server&#12399;&#12289;&#12487;&#12451;&#12473;&#12463;&#12392;&#12513;&#12514;&#12522;&#12434;&#31649;&#29702;&#12377;&#12427;&#12383;&#12417;&#12398;&#32113;&#35336;&#12395;&#22522;&#12389;&#12356;&#12390;&#12514;&#12491;&#12479;&#12362;&#12424;&#12403;&#22577;&#21578;&#12434;&#12375;&#12414;&#12377;&#12290;&#12354;&#12425;&#12422;&#12427;&#22810;&#38542;&#23652;&#12461;&#12515;&#12483;&#12471;&#12517;&#12392;&#21516;&#27096;&#12395;&#12289;&#12487;&#12540;&#12479;&#12398;&#12527;&#12540;&#12461;&#12531;&#12464;&#12475;&#12483;&#12488;&#12364;&#12496;&#12465;&#12483;&#12488;&#12391;&#21033;&#29992;&#21487;&#33021;&#12394;RAM&#21106;&#12426;&#24403;&#12390;&#37327;&#65288;&#19968;&#27425;&#12461;&#12515;&#12483;&#12471;&#12517;&#65289;&#12434;&#36229;&#12360;&#12383;&#22580;&#21512;&#12399;&#12289;&#12487;&#12451;&#12473;&#12463;&#12450;&#12463;&#12475;&#12473;&#12395;&#12424;&#12427;&#39640;&#12356;&#12524;&#12452;&#12486;&#12531;&#12471;&#12392;&#12289;&#20302;&#12356;&#12473;&#12523;&#12540;&#12503;&#12483;&#12488;&#12398;&#12379;&#12356;&#12391;&#12289;&#24615;&#33021;&#12399;&#26997;&#31471;&#12395;&#33853;&#12385;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;&#12471;&#12473;&#12486;&#12512;&#12398;&#35377;&#23481;&#21487;&#33021;&#12394;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#12399;&#32113;&#35336;&#12434;&#30435;&#35222;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
          </p></li><li class="listitem"><p>
            <span class="bold"><strong>&#12469;&#12540;&#12496;&#12398;&#21106;&#12426;&#24403;&#12390;</strong></span>
          </p><p>
            &#21508;&#12469;&#12540;&#12496;&#12494;&#12540;&#12489;&#12364;&#12507;&#12473;&#12488;&#12471;&#12473;&#12486;&#12512;&#19978;&#12391;&#21033;&#29992;&#21487;&#33021;&#12394;&#12471;&#12473;&#12486;&#12512;&#12398;&#12513;&#12514;&#12522;&#37327;&#12434;&#23450;&#32681;&#12377;&#12427;&#12513;&#12514;&#12522;&#21106;&#12426;&#24403;&#12390;&#37327;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#26368;&#21021;&#12398;&#12494;&#12540;&#12489;&#12395;&#35373;&#23450;&#12375;&#12383;&#12513;&#12514;&#12522;&#21106;&#12426;&#24403;&#12390;&#37327;&#12399;&#12289;&#38918;&#27425;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12377;&#12427;&#20840;&#12390;&#12398;&#12494;&#12540;&#12489;&#12395;&#32153;&#25215;&#12373;&#12428;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;&#12494;&#12540;&#12489;&#19978;&#12391;&#35373;&#23450;&#12373;&#12428;&#12427;&#26368;&#22823;&#12513;&#12514;&#12522;&#21106;&#12426;&#24403;&#12390;&#37327;&#12399;&#12289;&#12381;&#12398;&#12494;&#12540;&#12489;&#19978;&#12398;&#29289;&#29702;RAM&#12398;&#21512;&#35336;&#12398;80&#65285;&#20197;&#19979;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12513;&#12514;&#12522;&#21106;&#12426;&#24403;&#12390;&#37327;&#12398;1.25&#20493;&#12398;&#12513;&#12514;&#12522;&#12434;&#25345;&#12383;&#12394;&#12356;&#12469;&#12540;&#12496;&#12399;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12379;&#12435;&#65288;&#21106;&#12426;&#24403;&#12390;&#21487;&#33021;&#12394;&#12513;&#12514;&#12522;&#12399;&#29289;&#29702;RAM&#12398;80%&#12414;&#12391;&#12391;&#12354;&#12427;&#12383;&#12417;&#65289;&#12290;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12463;&#12521;&#12473;&#12479;&#12384;&#12387;&#12383;&#12469;&#12540;&#12496;&#12364;&#21029;&#12398;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12377;&#12427;&#22580;&#21512;&#12289;&#12513;&#12514;&#12522;&#12398;&#21106;&#12426;&#24403;&#12390;&#37327;&#12399;&#12289;&#12494;&#12540;&#12489;&#12364;&#21442;&#21152;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#32153;&#25215;&#12373;&#12428;&#12414;&#12377;&#12290;
          </p><p>
            &#12469;&#12540;&#12496;&#12494;&#12540;&#12489;&#12399;&#12289;&#12487;&#12451;&#12473;&#12463;&#12463;&#12457;&#12540;&#12479;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12399;&#12289;&#20491;&#12293;&#12398;&#12469;&#12540;&#12496;&#12540;&#12494;&#12540;&#12489;&#19978;&#12398;&#31354;&#12365;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12434;&#30435;&#35222;&#12377;&#12427;&#36012;&#20219;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12469;&#12540;&#12496;&#12540;&#12494;&#12540;&#12489;&#12399;&#12289;&#12487;&#12540;&#12479;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#12487;&#12451;&#12473;&#12463;&#19978;&#12398;&#22580;&#25152;&#12395;&#29420;&#33258;&#12398;&#12473;&#12488;&#12524;&#12540;&#12472;&#12497;&#12473;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12473;&#12488;&#12524;&#12540;&#12472;&#12497;&#12473;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12469;&#12540;&#12496;&#12494;&#12540;&#12489;&#12391;&#21516;&#19968;&#12391;&#12354;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12463;&#12521;&#12473;&#12479;&#12384;&#12387;&#12383;&#12469;&#12540;&#12496;&#12364;&#21029;&#12398;&#12463;&#12521;&#12473;&#12479;&#12395;&#32080;&#21512;&#12377;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#12381;&#12398;&#12469;&#12540;&#12496;&#12540;&#29992;&#12398;&#12473;&#12488;&#12524;&#12540;&#12472;&#12398;&#12497;&#12473;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
          </p></li><li class="listitem"><p>
            <span class="bold"><strong>&#12496;&#12465;&#12483;&#12488;&#12398;&#21106;&#12426;&#24403;&#12390;</strong></span>
          </p><p>
            &#12513;&#12514;&#12522;&#12463;&#12457;&#12540;&#12479;&#12398;&#21106;&#12426;&#24403;&#12390;&#12399;&#12289;&#12496;&#12465;&#12483;&#12488;&#21336;&#20301;&#12395;&#21046;&#24481;&#12373;&#12428;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12354;&#12383;&#12426;&#12398;&#12513;&#12514;&#12522;&#12398;&#22266;&#23450;&#37327;&#12399;&#12289;&#12496;&#12465;&#12483;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12434;&#36861;&#21152;&#12414;&#12383;&#12399;&#21066;&#38500;&#12377;&#12427;&#12392;&#12289;&#12496;&#12465;&#12483;&#12488;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;
          </p></li></ul></div></div><div class="navfooter"><hr><table summary="Navigation footer" width="100%"><tr><td align="left" width="40%"><a accesskey="p" href="couchbase-introduction-architecture-clustermanager.html">&#25147;&#12427;</a>&nbsp;</td><td align="center" width="20%"><a accesskey="u" href="couchbase-introduction-architecture.html">&#19978;&#12395;&#25147;&#12427;</a></td><td align="right" width="40%">&nbsp;<a accesskey="n" href="couchbase-introduction-architecture-buckets.html">&#27425;&#12408;</a></td></tr><tr><td valign="top" align="left" width="40%">1.3.2. &#12463;&#12521;&#12473;&#12479;&#12510;&#12493;&#12540;&#12472;&#12515;&nbsp;</td><td align="center" width="20%"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td valign="top" align="right" width="40%">&nbsp;1.3.4. &#12496;&#12465;&#12483;&#12488;</td></tr></table></div><hr><div class="couchone-link">
      Copyright (c) 2010-2013<a href="http://www.couchbase.com">Couchbase, Inc.</a></div></body></html>