<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Couchbase Server &#12510;&#12491;&#12517;&#12450;&#12523; 2.0 - &#31532;5&#31456; &#31649;&#29702;&#12479;&#12473;&#12463; - 5.4.1. &#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;</title><link href="couchdocs.css" type="text/css" rel="stylesheet"><meta content="DocBook XSL Stylesheets V1.76.1" name="generator"><link rel="home" href="index.html" title="Couchbase Server &#12510;&#12491;&#12517;&#12450;&#12523; 2.0"><link rel="up" href="couchbase-admin-tasks-compaction.html" title="5.4. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;"><link rel="prev" href="couchbase-admin-tasks-compaction.html" title="5.4. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;"><link rel="next" href="couchbase-admin-tasks-compaction-autocompaction.html" title="5.4.2. &#33258;&#21205;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12398;&#35373;&#23450;"><meta name="date" content="2013-06-26T23:53:47+00:00"><link type="image/x-icon" href="http://www.couchbase.com/sites/default/files/nosql_favicon.ico" rel="shortcut icon"><div class="inpagenav"><div class="googlesearch"><div class="inpagenav-home-title">Search:</div><form method="GET" action="http://www.google.com/search"><input type="text" name="q" size="24" maxlength="255"><input type="hidden" name="domains" value="www.couchbase.com/docs"><br><input type="radio" name="sitesearch" value="www.couchbase.com/docs"><b>Search all manuals</b><br><input type="radio" name="sitesearch" value="www.couchbase.com/docs/couchbase-manual-2.0/" checked><b>Search this manual</b><input type="submit" name="btnG" value="Google Search"></form></div><div class="inpagenav-home"><div class="inpagenav-home-title">Manual</div><a href="index.html"> Couchbase Server &#12510;&#12491;&#12517;&#12450;&#12523; 2.0 </a></div><div class="inpagenav-doccommunity"><div class="inpagenav-doccommunity-title">Community Wiki and Resources</div><div><table summary="Simple list" border="0" class="simplelist"><tr><td>
              <a class="ulink" href="http://www.couchbase.com/downloads" target="_top">Couchbase Server 2.0&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;</a>
            </td></tr><tr><td>
              <a class="ulink" href="http://www.couchbase.com/docs/couchbase-devguide-2.0/index.html" target="_top">Couchbase &#38283;&#30330;&#32773;&#12460;&#12452;&#12489; 2.0</a>
            </td></tr><tr><td>
              <a class="ulink" href="http://www.couchbase.com/develop" target="_top">&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12521;&#12452;&#12502;&#12521;&#12522;</a>
            </td></tr><tr><td>
              <a class="ulink" href="http://www.couchbase.com/forums/couchbase/couchbase-server-20x" target="_top">Couchbase Server &#12501;&#12457;&#12540;&#12521;&#12512;</a>
            </td></tr></table></div></div><div class="inpagenav-genericcommunity"><div class="inpagenav-genericcommunity-title">Additional Resources</div><div><a href="http://www.couchbase.com/wiki">
              Community Wiki
            </a></div><div><a href="http://www.couchbase.com/forums">
              Community Forums
            </a></div><div><a href="http://www.couchbase.com/develop">
              Couchbase SDKs
            </a></div></div><div class="inpagenav-up"><div class="inpagenav-up-title">Parent Section</div><a href="couchbase-admin-tasks-compaction.html">5.4 &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;</a></div><div class="inpagenav-siblings"><div class="inpagenav-siblings-title">Chapter Sections</div><div class="inpagenav-sibling-link"><a class="currentnav" href="couchbase-admin-tasks-compaction-process.html">5.4.1 &#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-admin-tasks-compaction-autocompaction.html">5.4.2 &#33258;&#21205;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12398;&#35373;&#23450;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-admin-tasks-compaction-strategies.html">5.4.3 &#33258;&#21205;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#25126;&#30053;</a></div><div class="inpagenav-sibling-link"><a href="couchbase-admin-tasks-compaction-spatial.html">5.4.4 &#31354;&#38291;&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;</a></div></div><div class="inpagenav-chapters"><div class="inpagenav-chapters-title">Chapters</div><div class="inpagenav-chapters-link"><a href="couchbase-server-2-0-preface.html"> &#12399;&#12376;&#12417;&#12395;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-introduction.html">1 Couchbase Server&#12398;&#27010;&#35201;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-getting-started.html">2 &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12392;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-basics.html">3 &#12463;&#12521;&#12473;&#12479;&#31649;&#29702;&#12398;&#22522;&#26412;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-bestpractice.html">4 &#12505;&#12473;&#12488;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;
</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-tasks.html">5 &#31649;&#29702;&#12479;&#12473;&#12463;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-web-console.html">6 Web&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#21033;&#29992;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-cmdline.html">7 &#31649;&#29702;&#29992;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-admin-restapi.html">8 REST API&#12398;&#21033;&#29992;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-views.html">9 &#12499;&#12517;&#12540;&#12392;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-monitoring.html">10 Couchbase&#12398;&#30435;&#35222;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-troubleshooting.html">11 &#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-faq.html">A &#12424;&#12367;&#12354;&#12427;&#36074;&#21839;&#65288;FAQ&#65289;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-uninstalling.html">B Couchbase Server&#12398;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-sampledata.html">C Couchbase&#12398;&#12469;&#12531;&#12503;&#12523;&#12496;&#12465;&#12483;&#12488;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-views-troubleshooting.html">D &#12499;&#12517;&#12540;&#12398;&#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;&#65288;&#25216;&#34899;&#30340;&#32972;&#26223;&#65289;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-server-rn.html">E &#12522;&#12522;&#12540;&#12473;&#12494;&#12540;&#12488;</a></div><div class="inpagenav-chapters-link"><a href="couchbase-server-limits.html">F &#38480;&#30028;&#20516;</a></div></div></div><script type="text/javascript">
var _gaq = _gaq || [];
_gaq.push(['_setAccount', 'UA-7763794-1']);
_gaq.push(['_setDomainName', '.couchbase.com']);
_gaq.push(['_setAllowLinker', true]);
_gaq.push(['_setAllowHash', false]);
_gaq.push(['_trackPageview']);
(function() {
var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
})();
</script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table summary="Navigation header" width="100%"><tr><th align="center" colspan="3">5.4.1. &#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;</th></tr><tr><td align="left" width="20%"><a accesskey="p" href="couchbase-admin-tasks-compaction.html">&#25147;&#12427;</a>&nbsp;</td><th align="center" width="60%">5.4. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;</th><td align="right" width="20%">&nbsp;<a accesskey="n" href="couchbase-admin-tasks-compaction-autocompaction.html">&#27425;&#12408;</a></td></tr></table><hr></div><div class="section" title="5.4.1. &#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;"><div class="titlepage"><div><div><h3 class="title"><a name="couchbase-admin-tasks-compaction-process"></a>5.4.1. &#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;</h3></div></div></div><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#27425;&#12398;&#12424;&#12358;&#12395;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#26032;&#12375;&#12356;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#26082;&#23384;&#12398;&#12377;&#12409;&#12390;&#12398;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#24773;&#22577;&#12364;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12395;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#26032;&#12375;&#12356;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12501;&#12449;&#12452;&#12523;&#12399;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#21508;&#12487;&#12470;&#12452;&#12531;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12372;&#12392;&#12395;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#24773;&#22577;&#12364;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12395;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;&#20013;&#12391;&#12418;&#12289;&#26082;&#23384;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12399;&#27531;&#12426;&#12289;&#24773;&#22577;&#12434;&#26684;&#32013;&#12375;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12487;&#12540;&#12479;&#12434;&#26356;&#26032;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#32154;&#12369;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#20013;&#12418;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12377;&#12427;&#12392;&#12289;&#21476;&#12356;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12399;&#28961;&#21177;&#12394;&#12426;&#12289;&#26360;&#12365;&#36796;&#12415;&#12420;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12399;&#12289;&#26032;&#12375;&#12367;&#20316;&#25104;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12391;&#32153;&#32154;&#12373;&#12428;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#21476;&#12356;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12381;&#12398;&#24460;&#12289;&#12471;&#12473;&#12486;&#12512;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;
</p></li></ul></div><p>&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12398;&#12383;&#12417;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;&#12391;&#12399;&#20197;&#19979;&#12398;&#12371;&#12392;&#12395;&#27880;&#24847;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306;</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>Couchbase&#12469;&#12540;&#12496;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#38291;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12539;&#12503;&#12525;&#12475;&#12473;&#12392;&#12375;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#12471;&#12515;&#12483;&#12488;&#12480;&#12454;&#12531;&#12375;&#12383;&#12426;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#25805;&#20316;&#12434;&#19968;&#26178;&#20572;&#27490;&#12377;&#12427;&#24517;&#35201;&#12418;&#12394;&#12367;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#31292;&#21205;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#12450;&#12463;&#12475;&#12473;&#12375;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#36865;&#20449;&#12375;&#32154;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;Couchbase Server&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21336;&#19968;&#12398;&#12469;&#12540;&#12496;&#19978;&#12398;&#12415;&#12391;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12494;&#12540;&#12489;&#12289;&#21508;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12451;&#12473;&#12463;&#12392;CPU&#20001;&#26041;&#12395;&#23550;&#12375;&#12390;&#36000;&#33655;&#12364;&#12363;&#12363;&#12427;&#20966;&#29702;&#12391;&#12377;&#12290;&#38750;&#24120;&#12395;&#28608;&#12375;&#12356;&#26360;&#36796;&#12415;&#35201;&#27714;&#12434;&#20966;&#29702;&#12377;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12500;&#12540;&#12463;&#12479;&#12452;&#12512;&#12434;&#36991;&#12369;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#12458;&#12540;&#12488;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#23455;&#34892;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12289;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p></li><li class="listitem"><p>&#24040;&#22823;&#12391;&#22810;&#24537;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12395;&#12399;&#38750;&#24120;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12383;&#12417;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#38291;&#12399;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12364;&#27491;&#24120;&#12395;&#23436;&#20102;&#12375;&#12394;&#12356;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#26997;&#31471;&#12394;&#20363;&#12434;&#19978;&#12370;&#12427;&#12392;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12398;&#12503;&#12525;&#12475;&#12473;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#22793;&#26356;&#12395;&#36861;&#12356;&#12388;&#12363;&#12378;&#12289;&#26368;&#32066;&#30340;&#12395;&#12377;&#12409;&#12390;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12434;&#20351;&#29992;&#12375;&#12390;&#12375;&#12414;&#12358;&#22580;&#21512;&#12394;&#12393;&#12391;&#12377;&#12290;</p><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12371;&#12398;&#21839;&#38988;&#12434;&#38450;&#12368;&#12383;&#12417;&#12395;&#12289;&#12458;&#12501;&#12500;&#12540;&#12463;&#26178;&#12395;&#23455;&#34892;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;&#20572;&#27490;&#12375;&#12383;&#12426;&#20877;&#38283;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;&#12364;&#20572;&#27490;&#12375;&#12390;&#12363;&#12425;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#26356;&#26032;&#12373;&#12428;&#12289;&#12381;&#12398;&#24460;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12434;&#20877;&#38283;&#12377;&#12427;&#12392;&#12289;&#26356;&#26032;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12399;&#23436;&#20840;&#12395;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12364;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12434;&#20572;&#27490;&#12375;&#12289;&#20877;&#38283;&#12377;&#12427;&#21069;&#12395;&#20966;&#29702;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#19968;&#37096;&#12399;&#12289;&#12377;&#12391;&#12395;&#22793;&#26356;&#12373;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#26032;&#12375;&#12356;&#12501;&#12449;&#12452;&#12523;&#12434;&#29983;&#25104;&#12375;&#12383;&#12426;&#12289;&#24773;&#22577;&#12434;&#26356;&#26032;&#12377;&#12427;&#12371;&#12392;&#12391;&#23455;&#34892;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#29694;&#22312;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12501;&#12449;&#12452;&#12523;&#12398;&#65298;&#20493;&#31243;&#24230;&#12398;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#20013;&#12398;&#22793;&#26356;&#12418;&#26356;&#26032;&#12487;&#12540;&#12479;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12416;&#24517;&#35201;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12524;&#12505;&#12523;&#12289;<span class="emphasis"><em>&#28961;&#21177;&#21270;&#12373;&#12428;&#12383;</em></span>&#12487;&#12540;&#12479;&#12398;&#37327;&#12289;&#12381;&#12375;&#12390;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#27963;&#21205;&#29366;&#27841;&#12395;&#24540;&#12376;&#12390;&#24517;&#35201;&#12392;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12398;&#27491;&#30906;&#12394;&#37327;&#12434;&#30041;&#24847;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12399;&#37325;&#35201;&#12391;&#12377;&#12290;</p><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12364;&#34892;&#12431;&#12428;&#12427;&#21069;&#12395;&#12289;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12364;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12289;&#20351;&#29992;&#21487;&#33021;&#12394;&#12487;&#12451;&#12473;&#12463;&#38936;&#22495;&#12364;&#29694;&#22312;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12469;&#12452;&#12474;&#12398;2&#20493;&#26410;&#28288;&#12391;&#12354;&#12428;&#12400;&#12289;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12399;&#34892;&#12431;&#12428;&#12378;&#12289;&#35686;&#21578;&#12364;&#12525;&#12464;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;<a class="xref" href="couchbase-admin-web-console-log.html" title="6.7. &#12525;&#12464;">&#12300;
      <span class="guilabel">&#12525;&#12464;</span>
    &#12301;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></li><li class="listitem"><p>&#33258;&#21205;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12434;&#21033;&#29992;&#12377;&#12427;&#12392;&#12289;&#33258;&#21205;&#30340;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#19978;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12503;&#12525;&#12475;&#12473;&#12364;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;</p></li><li class="listitem"><p>&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12398;&#27963;&#21205;&#29366;&#27841;&#12399;Couchbase Server&#12398;&#12525;&#12464;&#12395;&#22577;&#21578;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#25805;&#20316;&#12392;&#23455;&#34892;&#26178;&#38291;&#12434;&#31034;&#12377;&#27425;&#12398;&#12424;&#12358;&#12394;&#12456;&#12531;&#12488;&#12522;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#65306;</p><pre class="programlisting"><span class="line">Service couchbase_compaction_daemon exited on node 'ns_1@127.0.0.1' in 0.00s</span>
<span class="line">(repeated 1 times)</span></pre><p>&#12525;&#12464;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a class="xref" href="couchbase-admin-web-console-log.html" title="6.7. &#12525;&#12464;">&#12300;
      <span class="guilabel">&#12525;&#12464;</span>
    &#12301;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p></li></ul></div></div><div class="navfooter"><hr><table summary="Navigation footer" width="100%"><tr><td align="left" width="40%"><a accesskey="p" href="couchbase-admin-tasks-compaction.html">&#25147;&#12427;</a>&nbsp;</td><td align="center" width="20%"><a accesskey="u" href="couchbase-admin-tasks-compaction.html">&#19978;&#12395;&#25147;&#12427;</a></td><td align="right" width="40%">&nbsp;<a accesskey="n" href="couchbase-admin-tasks-compaction-autocompaction.html">&#27425;&#12408;</a></td></tr><tr><td valign="top" align="left" width="40%">5.4. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12499;&#12517;&#12540;&#12398;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&nbsp;</td><td align="center" width="20%"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td valign="top" align="right" width="40%">&nbsp;5.4.2. &#33258;&#21205;&#12467;&#12531;&#12497;&#12463;&#12471;&#12519;&#12531;&#12398;&#35373;&#23450;</td></tr></table></div><hr><div class="couchone-link">
      Copyright (c) 2010-2013<a href="http://www.couchbase.com">Couchbase, Inc.</a></div></body></html>